cities = {
    'Волинська': 'АС', 'Львівска': 'ВС', 'Закарпатська': 'АО', 'Рівненська': 'ВК', 'Тернопільска': 'ВО',
    'Івано-Франківська': 'АТ', 'Житомирська': 'АМ', 'Вінницька': 'АВ', 'Чернівецька': 'СЕ', 'Київ': 'АА',
    'Київська': 'АІ', 'Черкаська': 'СА', 'Миколаївська': 'ВЕ', 'Одеська': 'ВН',
    'Чернігівська': 'СВ', 'Полтавська': 'ВІ', 'Кіровоградська': 'ВА', 'Херсонська': 'ВТ', 'Крим': 'АК',
    'Севастополь': 'СН', 'Харківська': 'АХ', 'Дніпропетровська': 'АЕ', 'Запорізька': 'АР', 'Луганська': 'ВВ',
    'Донецька': 'АН'
}
